<?php

return [
    'singular' => 'طلب الإضافه',
    'plural' => 'طلبات الإضافه',
    'empty' => 'لا يوجد طلبات إضافه حتى الان',
    'count' => 'عدد طلبات الإضافه',
    'search' => 'بحث',
    'select' => 'اختر طلب الإضافه',
    'permission' => 'ادارة طلبات الإضافه',
    'trashed' => 'طلبات الإضافه المحذوفين',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن طلب إضافه',
    'active' => 'تمت إضافتها',
    'inactive' => 'في الانتظار',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة طلب إضافه',
        'show' => 'عرض طلب الإضافه',
        'edit' => 'تعديل طلب الإضافه',
        'delete' => 'حذف طلب الإضافه',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'added' => 'تم اضافه المحتوى',
        'cannot_be_added' => 'لا يمكن اضافه المحتوى ، خانه غير صحيحة',
        'created' => 'تم اضافة طلب الإضافه بنجاح.',
        'updated' => 'تم تعديل طلب الإضافه بنجاح.',
        'deleted' => 'تم حذف طلب الإضافه بنجاح.',
        'restored' => 'تم استعادة طلب الإضافه بنجاح.',
    ],
    'attributes' => [
        'name' => 'اسم طلب الإضافه',
        '%name%' => 'اسم طلب الإضافه',
        
            "name" => "محتوى الإضافه",
            "%name%" => "محتوى الإضافه",
            "field" => "المحتوى",
            "status" => "الحالة",
        'created_at' => 'اضافة في',
        'deleted_at' => 'حذف في',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف طلب الإضافه',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة هذا طلب الإضافه',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل أنت متأكد انك تريد حذف هذا طلب الإضافه نهائياً?',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],
    'fields' => [
        'category' => 'قسم',
        'feature' => 'خاصية',
        'option' => 'اوبشن',
        'country' => 'الدولة',
        'city' => 'المدينة',
        'area' => 'المنطقة',
    ]
];
