<?php

return [
    'singular' => 'الشاشة الإفتتاحية',
    'plural' => 'الشاشات الإفتتاحية',
    'empty' => 'لا يوجد شاشات إفتتاحية حتى الان',
    'count' => 'عدد الشاشات الإفتتاحية',
    'search' => 'بحث',
    'select' => 'اختر الشاشة الإفتتاحية',
    'permission' => 'ادارة الشاشات الإفتتاحية',
    'trashed' => 'الشاشات الإفتتاحية المحذوفين',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن شاشة إفتتاحية',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة شاشة إفتتاحية',
        'show' => 'عرض الشاشة الإفتتاحية',
        'edit' => 'تعديل الشاشة الإفتتاحية',
        'delete' => 'حذف الشاشة الإفتتاحية',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة الشاشة الإفتتاحية بنجاح.',
        'updated' => 'تم تعديل الشاشة الإفتتاحية بنجاح.',
        'deleted' => 'تم حذف الشاشة الإفتتاحية بنجاح.',
        'restored' => 'تم استعادة الشاشة الإفتتاحية بنجاح.',
    ],
    'attributes' => [
        'url' => 'رابط الشاشة الإفتتاحية',
        'country_id' => 'الدولة',
        'city_id' => 'المدينة',
        'views' => 'المشاهدات',
        'image' => 'الصورة',
        'created_at' => 'اضافة في',
        'deleted_at' => 'حذف في',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف الشاشة الإفتتاحية',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة هذا الشاشة الإفتتاحية',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل أنت متأكد انك تريد حذف هذا الشاشة الإفتتاحية نهائياً?',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],
];
