<?php

return [
    'singular' => 'الأوبشن',
    'plural' => 'الأوبشنز',
    'empty' => 'لا يوجد أوبشنز حتى الان',
    'count' => 'عدد الأوبشنز',
    'search' => 'بحث',
    'select' => 'اختر الأوبشن',
    'permission' => 'ادارة الأوبشنز',
    'trashed' => 'الأوبشنز المحذوفين',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن أوبشن',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة أوبشن',
        'show' => 'عرض الأوبشن',
        'edit' => 'تعديل الأوبشن',
        'delete' => 'حذف الأوبشن',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة الأوبشن بنجاح.',
        'updated' => 'تم تعديل الأوبشن بنجاح.',
        'deleted' => 'تم حذف الأوبشن بنجاح.',
        'restored' => 'تم استعادة الأوبشن بنجاح.',
    ],
    'attributes' => [
        'name' => 'اسم الأوبشن',
        '%name%' => 'اسم الأوبشن',
        'feature_id' => 'اسم الخاصية',
        'created_at' => 'اضافة في',
        'deleted_at' => 'حذف في',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف الأوبشن',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة هذا الأوبشن',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل أنت متأكد انك تريد حذف هذا الأوبشن نهائياً?',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],
];
