<?php

return [
    'singular' => 'طلب شراء الإعلان',
    'plural' => 'طلبات شراء الإعلانات',
    'empty' => 'لا يوجد طلبات شراء الإعلانات حتى الان',
    'count' => 'عدد طلبات شراء الإعلانات',
    'search' => 'بحث',
    'select' => 'اختر طلب شراء الإعلان',
    'permission' => 'ادارة طلبات شراء الإعلانات',
    'trashed' => 'طلبات شراء الإعلانات المحذوفين',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن طلب شراء',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة طلب شراء',
        'show' => 'عرض طلب شراء الإعلان',
        'edit' => 'تعديل طلب شراء الإعلان',
        'delete' => 'حذف طلب شراء الإعلان',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة طلب شراء الإعلان بنجاح.',
        'updated' => 'تم تعديل طلب شراء الإعلان بنجاح.',
        'deleted' => 'تم حذف طلب شراء الإعلان بنجاح.',
        'restored' => 'تم استعادة طلب شراء الإعلان بنجاح.',
    ],
    'attributes' => [
        'name' => 'اسم طلب شراء الإعلان',
        
            "status" => "الحالة",
        'created_at' => 'اضافة في',
        'deleted_at' => 'حذف في',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف طلب شراء الإعلان',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة هذا طلب شراء الإعلان',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل أنت متأكد انك تريد حذف هذا طلب شراء الإعلان نهائياً?',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],
    'status' => [
        \App\Models\OrderRequest::BENDING => 'مُعلق',
        \App\Models\OrderRequest::ACCEPTED => 'مقبول',
        \App\Models\OrderRequest::REFUSED => 'مرفوض',
    ],
];
