<?php

return [
    'plural' => 'الباقات',
    'singular' => 'الباقة',
    'empty' => 'لا توجد باقات',
    'select' => 'اختر الباقة',
    'select-type' => 'الكل',
    'perPage' => 'عدد النتائج في الصفحة',
    'filter' => 'ابحث عن باقة',
    'actions' => [
        'list' => 'عرض الكل ',
        'show' => 'عرض',
        'create' => 'إضافة باقة جديدة',
        'edit' => 'تعديل  الباقة',
        'delete' => 'حذف الباقة',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم إضافة الباقة بنجاح .',
        'updated' => 'تم تعديل الباقة بنجاح .',
        'deleted' => 'تم حذف الباقة بنجاح .',
    ],
    'attributes' => [
        'title' => 'اسم الباقة',
        '%title%' => 'اسم الباقة',
        'price' => 'سعر الباقة',
        'duration' => 'مدة الباقة بالشهر',
        'vip_no' => 'عدد اعلانات الفي اي بي',
        'special_no' => 'عدد اعلانات مميزة',
        'promotion_id' => 'نوع ترقية الحساب',
    ],
    'default' => [
        'name' => 'اسم الباقة',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل أنت متأكد انك تريد حذف هذه الباقة ?',
            'confirm' => 'حذف',
            'cancel' => 'إلغاء',
        ],
    ],

];
