<?php

return [
    'plural' => 'مميزات الباقات',
    'singular' => 'ميزات الباقة',
    'empty' => 'لا توجد باقات',
    'select' => 'اختر ميزات الباقة',
    'select-type' => 'الكل',
    'perPage' => 'عدد النتائج في الصفحة',
    'filter' => 'ابحث عن باقة',
    'actions' => [
        'list' => 'عرض الكل ',
        'show' => 'عرض',
        'create' => 'إضافة باقة جديدة',
        'edit' => 'تعديل  ميزات الباقة',
        'delete' => 'حذف ميزات الباقة',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم إضافة ميزات الباقة بنجاح .',
        'updated' => 'تم تعديل ميزات الباقة بنجاح .',
        'deleted' => 'تم حذف ميزات الباقة بنجاح .',
    ],
    'attributes' => [
        'title' => 'اسم ميزات الباقة',
        '%title%' => 'اسم ميزات الباقة',
        'description' => 'وصف ميزات الباقة',
        '%description%' => 'وصف ميزات الباقة',
        'package_id' => 'الباقة التابع ليها',
    ],
    'default' => [
        'name' => 'اسم ميزات الباقة',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل أنت متأكد انك تريد حذف هذه ميزات الباقة ?',
            'confirm' => 'حذف',
            'cancel' => 'إلغاء',
        ],
    ],

];
