<?php

return [
    'singular' => 'طريقة الدفع',
    'plural' => 'طرق الدفع',
    'empty' => 'لا يوجد طرق الدفع.',
    'count' => 'عدد الطرق الدفع',
    'search' => 'بحث',
    'select' => 'اختر طريقة الدفع',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن طرق الدفع',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة طرق الدفع',
        'show' => 'عرض طريقة الدفع',
        'edit' => 'تعديل طريقة الدفع',
        'delete' => 'حذف طريقة الدفع',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة طريقة الدفع بنجاح.',
        'updated' => 'تم تعديل طريقة الدفع بنجاح.',
        'deleted' => 'تم حذف طريقة الدفع بنجاح.',
    ],
    'attributes' => [
        'name' => 'اسم طريقة الدفع',
        '%name%' => 'اسم طريقة الدفع',
        'currency' => 'العملة',
        '%currency%' => 'العملة',
        'code' => 'كود طريقة الدفع',
        'key' => 'مفتاح طريقة الدفع',
        'flag' => 'صورة طريقة الدفع',
        'is_default' => 'الافتراضية',
        'created_at'=>'تم الانشاء',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف طريقة الدفع ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
    ],
];
