<?php

return [
    'singular' => 'النقطة المكتسبة',
    'plural' => 'النقاط المكتسبة',
    'empty' => 'لا يوجد نقاط حتى الان',
    'count' => 'عدد النقاط المكتسبة',
    'search' => 'بحث',
    'select' => 'اختر النقطة المكتسبة',
    'permission' => 'ادارة النقاط المكتسبة',
    'trashed' => 'النقاط المكتسبة المحذوفين',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن نقاط مكتسبة',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة نقاط مكتسبة',
        'show' => 'عرض النقطة المكتسبة',
        'edit' => 'تعديل النقطة المكتسبة',
        'delete' => 'حذف النقطة المكتسبة',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة النقطة المكتسبة بنجاح.',
        'updated' => 'تم تعديل النقطة المكتسبة بنجاح.',
        'deleted' => 'تم حذف النقطة المكتسبة بنجاح.',
        'restored' => 'تم استعادة النقطة المكتسبة بنجاح.',
    ],
    'attributes' => [
        'name' => 'اسم النقطة المكتسبة',
        
            "action" => "الحدث",
            "points" => "النقاط المكتسبة",
        'created_at' => 'اضافة في',
        'deleted_at' => 'حذف في',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف النقطة المكتسبة',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة هذا النقطة المكتسبة',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل أنت متأكد انك تريد حذف هذا النقطة المكتسبة نهائياً?',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],
];
