<?php

return [
    'singular' => 'سياسة المتاجر',
    'plural' => 'سياسات المتاجر',
    'empty' => 'لا يوجد سياسة المتجر حتى الان',
    'count' => 'عدد سياسات المتاجر',
    'search' => 'بحث',
    'select' => 'اختر سياسة المتاجر',
    'permission' => 'ادارة سياسات المتاجر',
    'trashed' => 'سياسات المتاجر المحذوفين',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن سياسة المتجر',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة سياسة المتجر',
        'show' => 'عرض سياسة المتاجر',
        'edit' => 'تعديل سياسة المتاجر',
        'delete' => 'حذف سياسة المتاجر',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة سياسة المتاجر بنجاح.',
        'updated' => 'تم تعديل سياسة المتاجر بنجاح.',
        'deleted' => 'تم حذف سياسة المتاجر بنجاح.',
        'restored' => 'تم استعادة سياسة المتاجر بنجاح.',
    ],
    'attributes' => [
        'name' => 'اسم سياسة المتاجر',
        '%name%' => 'اسم سياسة المتاجر',
        "name" => "الاسم",
        "%name%" => "الاسم",
        'shop_category_id' => 'قسم المتجر',
        'created_at' => 'اضافة في',
        'deleted_at' => 'حذف في',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف سياسة المتاجر',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة هذا سياسة المتاجر',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل أنت متأكد انك تريد حذف هذا سياسة المتاجر نهائياً?',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],
];
