<?php

return [
    'plural' => 'انواع الترقيات',
    'app_content' => 'محتوي التطبيق',
    'singular' => 'نوع الترقية',
    'empty' => 'لا توجد الترقيات',
    'select' => 'اختر نوع الترقية',
    'select-type' => 'الكل',
    'perPage' => 'عدد النتائج في الترقية',
    'filter' => 'ابحث عن ترقية',
    'actions' => [
        'list' => 'عرض الكل ',
        'show' => 'عرض',
        'create' => 'إضافة ترقية جديدة',
        'edit' => 'تعديل  نوع الترقية',
        'delete' => 'حذف نوع الترقية',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم إضافة نوع الترقية بنجاح .',
        'updated' => 'تم تعديل نوع الترقية بنجاح .',
        'deleted' => 'تم حذف نوع الترقية بنجاح .',
    ],
    'attributes' => [
        'title' => 'اسم نوع الترقية',
        '%title%' => 'اسم نوع الترقية',
        'type' => ' نوع حساب الترقية',
        '%content%' => 'محتوي نوع الترقية',
    ],
    'default' => [
        'name' => 'اسم نوع الترقية',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل أنت متأكد انك تريد حذف هذه نوع الترقية ?',
            'confirm' => 'حذف',
            'cancel' => 'إلغاء',
        ],
    ],

];
