<?php

return [
    'plural' => 'اسعار الخدمات',
    'singular' => 'سعر الخدمة',
    'empty' => 'لا توجد خدمات اسعار ',
    'select' => 'اختر سعر الخدمة',
    'select-type' => 'الكل',
    'perPage' => 'عدد النتائج في الصفحة',
    'trashed' => 'اسعار الخدمات المحذوفين',
    'filter' => 'ابحث عن خدمة',
    'actions' => [
        'list' => 'عرض الكل ',
        'show' => 'عرض',
        'create' => 'إضافة خدمة جديدة',
        'edit' => 'تعديل  سعر الخدمة',
        'delete' => 'حذف سعر الخدمة',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم إضافة سعر الخدمة بنجاح .',
        'updated' => 'تم تعديل سعر الخدمة بنجاح .',
        'deleted' => 'تم حذف سعر الخدمة بنجاح .',
    ],
    'attributes' => [
        'duration'=>'المدة',
        'service'=> 'اسم الخدمة',
        'service_id'=>'الخدمة',
        'price'=>'السعر',
        'title' => 'اسم سعر الخدمة',
        '%title%' => 'اسم سعر الخدمة',
        'content' => 'محتوي سعر الخدمة',
        '%content%' => 'محتوي سعر الخدمة',
        'created_at'=>'اضافه في',
        'deleted_at' => 'حذف في',
    ],
    'default' => [
        'name' => 'اسم سعر الخدمة',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل أنت متأكد انك تريد حذف هذه سعر الخدمة ?',
            'confirm' => 'حذف',
            'cancel' => 'إلغاء',
        ],
    ],
    'restore' => [
        'title' => 'تحذير !',
        'info' => 'هل انت متأكد انك تريد استعادة هذا الخدمة',
        'confirm' => 'استعادة',
        'cancel' => 'الغاء',
    ],
    'forceDelete' => [
        'title' => 'تحذير !',
        'info' => 'هل أنت متأكد انك تريد حذف هذا الخدمة نهائياً?',
        'confirm' => 'حذف نهائي',
        'cancel' => 'الغاء',
    ],

];
