<?php

return [
    'singular' => 'الخدمة',
    'plural' => 'الخدمات',
    'empty' => 'لا يوجد خدمات حتى الان',
    'count' => 'عدد الخدمات',
    'search' => 'بحث',
    'select' => 'اختر الخدمة',
    'permission' => 'ادارة الخدمات',
    'trashed' => 'الخدمات المحذوفين',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن خدمة',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة خدمة',
        'show' => 'عرض الخدمة',
        'edit' => 'تعديل الخدمة',
        'delete' => 'حذف الخدمة',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة الخدمة بنجاح.',
        'updated' => 'تم تعديل الخدمة بنجاح.',
        'deleted' => 'تم حذف الخدمة بنجاح.',
        'restored' => 'تم استعادة الخدمة بنجاح.',
    ],
    'attributes' => [
        'name' => 'اسم الخدمة',
        'type'=> 'نوع الخدمة',
        'promotion_ads'=>'ترقيه اعلان',
        'promotion_account'=>'ترقيه حساب',
        '%name%' => 'اسم الخدمة',
        "keyword" => "الخدمة",
        "%keyword%" => "الخدمة",
        'created_at' => 'اضافة في',
        'deleted_at' => 'حذف في',
        'service_id'=> 'الخدمة'
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف الخدمة',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة هذا الخدمة',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل أنت متأكد انك تريد حذف هذا الخدمة نهائياً?',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],
];
