<?php

return [
    'singular' => 'السلايدر',
    'plural' => 'السلايدرات',
    'empty' => 'لا يوجد سلايدرات حتى الان',
    'count' => 'عدد السلايدرات',
    'search' => 'بحث',
    'select' => 'اختر السلايدر',
    'permission' => 'ادارة السلايدرات',
    'trashed' => 'السلايدرات المحذوفين',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن سلايدر',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة سلايدر',
        'show' => 'عرض السلايدر',
        'edit' => 'تعديل السلايدر',
        'delete' => 'حذف السلايدر',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة السلايدر بنجاح.',
        'updated' => 'تم تعديل السلايدر بنجاح.',
        'deleted' => 'تم حذف السلايدر بنجاح.',
        'restored' => 'تم استعادة السلايدر بنجاح.',
    ],
    'attributes' => [
        'name' => 'اسم السلايدر',
        '%name%' => 'اسم السلايدر',
        'country_id' => 'الدولة',
        'url' => 'الرابط',
        'image' => 'صورة السلايدر',
        'created_at' => 'اضافة في',
        'deleted_at' => 'حذف في',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف السلايدر',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة هذا السلايدر',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل أنت متأكد انك تريد حذف هذا السلايدر نهائياً?',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],
];
