<?php

return [
    'singular' => 'شحن الرصيد',
    'plural' => 'شحن الرصيد',
    'empty' => 'لا يوجد شحن الرصيد حتى الان',
    'count' => 'عدد شحن الرصيد',
    'search' => 'بحث',
    'select' => 'اختر شحن الرصيد',
    'permission' => 'ادارة شحن الرصيد',
    'trashed' => 'شحن الرصيد المحذوفين',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن شحن الرصيد',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة شحن الرصيد',
        'show' => 'عرض شحن الرصيد',
        'edit' => 'تعديل شحن الرصيد',
        'delete' => 'حذف شحن الرصيد',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة شحن الرصيد بنجاح.',
        'updated' => 'تم تعديل شحن الرصيد بنجاح.',
        'deleted' => 'تم حذف شحن الرصيد بنجاح.',
        'restored' => 'تم استعادة شحن الرصيد بنجاح.',
    ],
    'attributes' => [
        'name' => 'اسم شحن الرصيد',
        'user_id' => 'العميل',
            "balance" => "الرصيد",
        'email'=>'البريد الالكترونى',
        'member_no'=>'رقم العضوية',
        'created_at' => 'اضافة في',
        'deleted_at' => 'حذف في',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف شحن الرصيد',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
        'restore' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد استعادة هذا شحن الرصيد',
            'confirm' => 'استعادة',
            'cancel' => 'الغاء',
        ],
        'forceDelete' => [
            'title' => 'تحذير !',
            'info' => 'هل أنت متأكد انك تريد حذف هذا شحن الرصيد نهائياً?',
            'confirm' => 'حذف نهائي',
            'cancel' => 'الغاء',
        ],
    ],
];
